app/controllers/history_controller.rb

  def index
    @historys = History.all
---
SELECT "histories".* FROM "histories"