app/controllers/history_controller.rb

  def index
    @history = History.all.limit(30).order('created_at DESC')
---
SELECT "histories".* FROM "histories" ORDER BY desc created_at

  def destroy
    d = History.find(params[:id])
    d.destroy
---
SELECT  "histories".* FROM "histories" WHERE "histories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "histories" WHERE "histories"."id" = $1  [["id", 1]]

  def clear
    History.delete_all
---
DELETE FROM "histories"