app/controllers/home_controller.rb

  def index
    # Guard Clause
    if params[:query].nil?
      render 'index' and return
    end

    history = History.new
    history.query = params[:query]
    history.save!
---
INSERT INTO "histories" ("query", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["query", "news brexit"], ["created_at", "2019-03-20 23:34:02.420024"], ["updated_at", "2019-03-20 23:34:02.420024"]]